# AnalyticalSolarHeatGainCoefficient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalSolarHeatGainCoefficient Property
ParameterTypeId Class See Also
---
"Solar Heat Gain Coefficient"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalSolarHeatGainCoefficient { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalSolarHeatGainCoefficient As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalSolarHeatGainCoefficient {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace